/*
 * =====================================================================================
 *
 *       Filename:  poem_print.h
 *
 *    Description:  控制台随机打印一首诗
 *
 *        Version:  1.0
 *        Created:  2013年05月21日 13时33分07秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  Hurley (LiuHuan), liuhuan1992@gmail.com
 *        Company:  Class 1107 of Computer Science and Technology
 *
 * =====================================================================================
 */

#ifndef POEM_PRINT_H_
#define POEM_PRINT_H_

struct poem_info
{
	char title[40];
	char date[100];
	char info[600];
};

struct poem_info poem[] = {
{
	"题目：《感怀》\n",
	"作者：浅墨    2012-6-29\n",
	"又到成荫结子时，流连韶光人归迟。\n"
	"年华易逝空一念，未负凌云却负诗。\n"
},
{
	"题目：《弱冠》\n",
	"作者：浅墨    2012-3-13\n",
	"犹忆昔年逢豆蔻，不觉今朝已弱冠。\n"
	"莫随浮萍逐风去，淡泊宁静守心间。\n"
	"拂晓闻鸡共起舞，三更灯火伴书眠。\n"
	"未遂凌云须谨记，男儿有求安得闲？\n"
},
{
	"题目：《无题》\n",
	"作者：浅墨    2012-2-7\n",
	"思及明日应重逢，今宵辗转难入梦。\n"
	"刻漏无情缓缓去，青鸟殷勤已先行。\n"
},
{
	"题目：《午后初雨》\n",
	"作者：浅墨    2010-11-28\n",
	"寒雨连风湿瓦墙，雾失楼阁隐池塘。\n"
	"桃红逐水花不再，一片春心付海棠。\n"
},
{
	"题目：《无题》\n",
	"作者：浅墨    2010-11-09\n",
	"九畹幽兰手自栽，相逐春意且徘徊。\n"
	"霜落木凋秋节至，能伴东风几长开？\n"
},
{
	"题目：《满庭芳-秋日应景》\n",
	"作者：浅墨    2011-11-2\n",
	"叶舞秋风，细雨才过，还晴、曲江天阔。\n"
	"西子明眸，伴影独酌处，依约雾陇星河。\n"
	"暮云收，疏影交错。\n"
	"一轮满，平分秋色，傍水清光落。\n"
	"\n"
	"空叹，流连处。旧时潇湘，当年皓月，几番曾照我。\n"
	"梦回庐州，未见故人辞色。\n"
	"纵回首，已误芳约。\n"
	"黯凝伫，佳人何在，徒几抹落寞。\n"
},
{
	"题目：《画堂春-随笔》\n",
	"作者：浅墨 2011-6-30 \n",
	"轻寒漠漠透罗衣，\n"
	"雨余乳燕飞低。\n"
	"留春无计春且去，\n"
	"绿绮音稀。\n"
	"\n"
	"柳外画阁独倚，\n"
	"凭栏醉数别离。\n"
	"却看落红逐水去，\n"
	"怎卜归期？\n"
},
{
	"题目：《石榴花-古绝》\n",
	"作者：浅墨    2011-5-22\n",
	"傲临雁塔众芳残，红巾半吐尽鲜妍。\n"
	"不随桃李逐春去，仲夏时节满长安。\n"
},
{
	"题目：《一剪梅-自勉》\n",
	"作者：浅墨    2011-5-22\n",
	"傲临雁塔众芳残，半吐红巾，独占鲜妍。\n"
	"翻嫌桃李开何早，自秉灵根，故迟凭栏。\n"
	"衣带渐宽寻无悔，曲江题名，杏林春宴。\n"
	"觅得春风得意处，桂落渭水，策马长安。\n"
},
{
	"题目：《唐多令-秋游》\n",
	"作者：浅墨    2010-8-26\n",
	"秋日游，桂花吹满头。\n"
	"正是秋气萧索、上层楼。\n"
	"\n"
	"轻拟小楫轻舟，看莲否？\n"
	"纵无芙蕖在，有残藕。\n"
},
{
	"题目：《画堂春-折桂》\n",
	"作者：浅墨    庚寅年夏\n",
	"晓霜红叶舞归程，红袂几度重逢。\n"
	"章台游冶且徐行，日暖柔晴。\n"
	"\n"
	"桃叶参差问渡，杏花零乱题名。\n"
	"月华如练晚风清，桂落中庭。\n"
},
{
	"题目：《满庭霜—抒怀》\n",
	"作者：浅墨    2010-4-26\n",
	"雁过斜阳，草迷烟渚。横笛声锁空屏。\n"
	"青衫湿遍，何处倚栏影？\n"
	"犹记昔年豆蔻，桃溪畔，霏雾弄晴。\n"
	"惜流芳，年来踪迹，谁与话长更？\n"
	"\n"
	"伤情、当此际。暝鸦零乱，顾影自萦。\n"
	"怨不得，章台柳色如旧，却舞脉脉风轻。\n"
	"酒已尽，孤醉难醒。\n"
	"东风恶，晓来梦断，一片枕前冰。\n"
},
{
	"题目：《满江红—雪梅》\n",
	"作者：浅墨    2010-5-9\n",
	"一枝潇洒、断崖路。疏影横斜、暗香透。\n"
	"清绝孤立，凌寒傲骨。\n"
	"秾华自得当空舞，也羞落、桃李千树。\n"
	"残月夜，屏山掩映处，映雪秀。\n"
	"\n"
	"对影怜，人自瘦。空余恨，堪寻否？\n"
	"心傲霜，轻薄粉蝶休触。\n"
	"青林笛落声归后，石屏棋散空枝守。\n"
	"浮花尽，方伴君幽独，香如旧。\n"
},
{
	"题目：《浪淘沙—记梦》\n",
	"作者：浅墨    庚寅年春末\n",
	"烟琐杏花楼，拟泛轻舟。秋千架下似水眸。\n"
	"雨余桃红掩映处，占尽风流。\n"
	"\n"
	"柳外画阁愁，绿绮琴幽。丁香缄蕊伴娇羞。\n"
	"朱桥当时携素手，绕指情柔。\n"
},
{
	"题目：《抒怀》\n",
	"作者：浅墨    庚寅年春末\n",
	"遍绕兰溪两三栽，桃夭灼华始重来。\n"
	"奈何青帝不知意，春风未至便忍开。\n"
},
{
	"题目：《鹧鸪天-赠别》\n",
	"作者：浅墨    庚寅年春\n",
	"濛濛纤雨燕飞低，雾失帘栊柳依依。\n"
	"斜阳渐落归无计，醉解兰舟春水溪。\n"
	"风细细，草萋萋。天涯何处觅归期。\n"
	"金樽未举离殇醉，抱影无眠泪沾衣。\n"
},
{
	"题目：《一剪梅·赠别》\n",
	"作者：浅墨    庚寅年春\n",
	"行尽平芜长亭望，把酒临风，凭栏目旷。\n"
	"醉笑陪公三万场，毋需折柳，不诉离殇。\n"
	"而今相逢亦容易，不似古人，未有凄凉。\n"
	"孑然挥手自兹去，数载同窗，前事莫忘。\n"
},
{
	"题目：《江城子—赠别》\n",
	"作者：浅墨    庚寅年春\n",
	"断烟衰草南浦路，共樽饮，浇离愁。\n"
	"阳关唱彻，凭栏说风流。\n"
	"垂柳渡头泛轻舟，风骤起，雨飕飕。\n"
	"\n"
	"此去何日共重游，天难期，人未留。\n"
	"黯思旅魂，独酌对空楼。\n"
	"远眺平芜断肠处，昏鸦尽，水悠悠。\n"
},
{
	"题目：《鹧鸪天—离觞》\n",
	"作者：浅墨    庚寅年春\n",
	"零乱瞑鸦落日楼，危栏困倚荡千愁。\n"
	"锦书难寄空余恨，犹记章台细柳柔。\n"
	"花落尽，絮飞悠。天心未许自难留。\n"
	"一樽清酒醉离觞，酒尽方拟作泪流。\n"
},
{
	"题目：《晓题西苑》\n",
	"作者：浅墨    2010-2-28\n",
	"雨藉残花数点红，凭高目断恨离亭。\n"
	"怎奈丛间双栖蝶，无端飞过秋千影。\n"
},
{
	"题目：《无题》\n",
	"作者：浅墨    2010-1-1\n",
	"衔恨何作天上月，为谁憔悴为谁怜。\n"
	"啼痕空惹襟袖上，长恨离亭独倚栏。\n"
	"几曾醉醒南浦路，衰草难结此间缘。\n"
	"回首夕阳红尽处，愁肠寸断对樽寒。\n"
} 

};

#endif

